### If Data had no titlem but you know the title

In [20]:
"""
2011 FEMALE GERALDINE 13 75
2011 FEMALE GIA 21 67
2011 FEMALE GIANNA 49 42
2011 FEMALE GISELLE 38 51
2011 FEMALE GRACE 36 53
"""
with open('Popular_Baby_Names_space_missing_title.txt') as f:
    lines=f.readlines()
lines[0:10]

['2011 FEMALE GERALDINE 13 75\n',
 '2011 FEMALE GIA 21 67\n',
 '2011 FEMALE GIANNA 49 42\n',
 '2011 FEMALE GISELLE 38 51\n',
 '2011 FEMALE GRACE 36 53\n',
 '2011 FEMALE GUADALUPE 26 62\n',
 '2011 FEMALE HAILEY 126 8\n',
 '2011 FEMALE HALEY 14 74\n',
 '2011 FEMALE HANNAH 17 71\n',
 '2011 FEMALE HAYLEE 17 71\n']

In [21]:
#We know how a dataframe being created df = pd.DataFrame(data=content, columns=columns)
#Now what missing is the header/column name, so we can "make" a column to it
columns=['Year_of_Birth', 'Gender', "Child's_First_Name", 'Count', 'Rank']
print(f'Your make up column name is {columns}')

Your make up column name is ['Year_of_Birth', 'Gender', "Child's_First_Name", 'Count', 'Rank']

In [22]:
#Then assign the column name to dataframe
content = []
for line in lines[:]:
    content.append(line.split())
df = pd.DataFrame(data=content, columns=columns)
df.head()

  Year_of_Birth  Gender Child's_First_Name Count Rank
0          2011  FEMALE          GERALDINE    13   75
1          2011  FEMALE                GIA    21   67
2          2011  FEMALE             GIANNA    49   42
3          2011  FEMALE            GISELLE    38   51
4          2011  FEMALE              GRACE    36   53

### If title and content had some text

In [9]:
"""
Year_of_Birth Gender Child's_First_Name Count Rank
==================================================
2011 FEMALE GERALDINE 13 75
2011 FEMALE GIA 21 67
"""
with open('Popular_Baby_Names_space_title_separ.txt') as f:
    lines=f.readlines()
lines[0:10]

["Year_of_Birth Gender Child's_First_Name Count Rank\n",
 '==================================================\n',
 '2011 FEMALE GERALDINE 13 75\n',
 '2011 FEMALE GIA 21 67\n',
 '2011 FEMALE GIANNA 49 42\n',
 '2011 FEMALE GISELLE 38 51\n',
 '2011 FEMALE GRACE 36 53\n',
 '2011 FEMALE GUADALUPE 26 62\n',
 '2011 FEMALE HAILEY 126 8\n',
 '2011 FEMALE HALEY 14 74\n']

In [18]:
#We cannot directly use previous functions, output will like below
columns=lines[0].split()
content = []
for line in lines[1:]:
    content.append(line.split())
df = pd.DataFrame(data=content, columns=columns)
df.head()

,Year_of_Birth,Gender,Child's_First_Name,Count,Rank
0,==============================================...,None,None,None,None
1,2011,FEMALE,GERALDINE,13,75
2,2011,FEMALE,GIA,21,67
3,2011,FEMALE,GIANNA,49,42
4,2011,FEMALE,GISELLE,38,51

In [14]:
#Check function to_df again, you'll see content below we start from 1, because 0 is column, so we need to change start location of content to 2 in the case.
"""
def to_df(lines:list)->pd.DataFrame:
    columns=lines[0].split()
    content = []
    for line in lines[1:]: <- here we start from 1
        content.append(line.split())
    df = pd.DataFrame(data=content, columns=columns)
    return df
"""
print(f'index 1 in lines is \n{lines[1]}')
print(f'index 2 in lines is \n{lines[2]}--->this is starting location we want')

index 1 in lines is
==================================================

index 2 in lines is
2011 FEMALE GERALDINE 13 75
--->this is starting location we want

In [15]:
#So we need to change the starting location
columns=lines[0].split()
content = []
for line in lines[2:]: #<- change to 2
    content.append(line.split())
df = pd.DataFrame(data=content, columns=columns)
df.head()

  Year_of_Birth  Gender Child's_First_Name Count Rank
0          2011  FEMALE          GERALDINE    13   75
1          2011  FEMALE                GIA    21   67
2          2011  FEMALE             GIANNA    49   42
3          2011  FEMALE            GISELLE    38   51
4          2011  FEMALE              GRACE    36   53